In [1]:
import pandas as pd

## Series and DataFrame

### series

In [2]:
l1 = [212,656,521,5,54] #list, tuple, dictionary

In [4]:
a = pd.Series(data=l1)

In [5]:
a

0    212
1    656
2    521
3      5
4     54
dtype: int64

In [6]:
labels = ['a','b','c','d','e']

In [7]:
b = pd.Series(data=l1, index = labels)

In [8]:
b

a    212
b    656
c    521
d      5
e     54
dtype: int64

In [9]:
d1 = {'a':1234, 'b':324564,'c':123121}

In [10]:
d1

{'a': 1234, 'b': 324564, 'c': 123121}

In [11]:
d = pd.Series(data=d1)

In [12]:
d   #1 will be the index, 2 will the values

a      1234
b    324564
c    123121
dtype: int64

In [13]:
type(d)

pandas.core.series.Series

### Data Frame

In [33]:
c1 = [[1,2,3,4],[5,6,7,8],[9,10,11,12]]

In [35]:
c1

[[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12]]

In [36]:
pd.DataFrame(data=c1)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [18]:
cols = ['w','x','y','z']

In [37]:
c= pd.DataFrame(data=c1,columns=cols)

In [38]:
c

   w   x   y   z
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [39]:
c['w']

0    1
1    5
2    9
Name: w, dtype: int64

In [40]:
c.w

0    1
1    5
2    9
Name: w, dtype: int64

In [41]:
c[['w','y']]

   w   y
0  1   3
1  5   7
2  9  11

In [42]:
c.head()   # first 5 rows of the dataframe

   w   x   y   z
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [43]:
 c.tail()  #last 5 rows

   w   x   y   z
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [44]:
c.describe()

         w     x     y     z
count  3.0   3.0   3.0   3.0
mean   5.0   6.0   7.0   8.0
std    4.0   4.0   4.0   4.0
min    1.0   2.0   3.0   4.0
25%    3.0   4.0   5.0   6.0
50%    5.0   6.0   7.0   8.0
75%    7.0   8.0   9.0  10.0
max    9.0  10.0  11.0  12.0

In [45]:
c = pd.DataFrame(data=c1,columns=cols, index=['g','h','k'])

In [56]:
c

   w   x   y   z
g  1   2   3   4
h  5   6   7   8
k  9  10  11  12

In [48]:
c.loc['g']  #location

w    1
x    2
y    3
z    4
Name: g, dtype: int64

In [54]:
c.iloc[1]  #index location # axis = 0,1 #0=rows, 1=columns

w    5
x    6
y    7
z    8
Name: h, dtype: int64

In [57]:
c.iloc[0:2, 1:3]  # slicing rows, columns

   x  y
g  2  3
h  6  7

In [58]:
c.iloc[:,1:3]

    x   y
g   2   3
h   6   7
k  10  11

In [59]:
c['m'] = [324152,231456,564897]

In [60]:
c

   w   x   y   z       m
g  1   2   3   4  324152
h  5   6   7   8  231456
k  9  10  11  12  564897

In [61]:
c.loc['l'] = [15,36,41,85,354564]

In [62]:
c

    w   x   y   z       m
g   1   2   3   4  324152
h   5   6   7   8  231456
k   9  10  11  12  564897
l  15  36  41  85  354564

In [66]:
c.iloc[2] = [321324,1524564,315,4,212]

In [67]:
c

        w        x    y   z       m
g       1        2    3   4  324152
h       5        6    7   8  231456
k  321324  1524564  315   4     212
l      15       36   41  85  354564

In [68]:
c.drop('y', axis=1)

        w        x   z       m
g       1        2   4  324152
h       5        6   8  231456
k  321324  1524564   4     212
l      15       36  85  354564

In [69]:
c

        w        x    y   z       m
g       1        2    3   4  324152
h       5        6    7   8  231456
k  321324  1524564  315   4     212
l      15       36   41  85  354564

In [70]:
c.drop('y', axis=1, inplace=True)

In [72]:
c

        w        x   z       m
g       1        2   4  324152
h       5        6   8  231456
k  321324  1524564   4     212
l      15       36  85  354564

In [ ]:
df  = pd.read_csv(r"c:/sdfaxfvds/sdcvfds/dfgverf/vsdfds/vefsd.csv")  #/n /t #r = rawtext/string